{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you",
          "Is anyone there?",
          "Hello",
          "Good day"
        ],
        "responses": [
          "Hey :-)",
          "Hello, thanks for visiting",
          "Hi there, what can I do for you?",
          "Hi there, how can I help?"
        ]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "See you later", "Goodbye"],
        "responses": [
          "See you later, thanks for visiting",
          "Have a nice day",
          "Bye! Come back again soon."
        ]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "That's helpful", "Thank's a lot!"],
        "responses": ["Happy to help!", "Any time!", "My pleasure"]
      },
      {"tag": "What does it mean to have a mental illness?","patterns": ["What does it mean to have a mental illness?"],"responses": ["Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning."]
      },
{"tag": "Who does mental illness affect?","patterns": ["Who does mental illness affect?"],"responses": ["Mental illness does can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background."]
      },
{"tag": "What are some of the warning signs of mental illness?","patterns": ["What are some of the warning signs of mental illness?"],"responses": ["Symptoms of mental health disorders vary depending on the type and severity of the condition."]
      },
{"tag": "Can people with mental illness recover?","patterns": ["Can people with mental illness recover?"],"responses": ["When healing from mental illness, early identification and treatment are of vital importance."]
      },
{"tag": "What should I do if I know someone who appears to have the symptoms of a mental disorder?","patterns": ["What should I do if I know someone who appears to have the symptoms of a mental disorder?"],"responses": ["We encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional."]
      },
{"tag": "How can I find a mental health professional for myself or my child?","patterns": ["How can I find a mental health professional for myself or my child?"],"responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of the treatment."]
      },
{"tag": "What treatment options are available?","patterns": ["What treatment options are available?"],"responses": ["Different treatment options are available for individuals with mental illness."]
      },
{"tag": "If I become involved in treatment, what do I need to know?","patterns": ["If I become involved in treatment, what do I need to know?"],"responses": ["It is important to be as involved and engaged in the treatment process as possible."]
      },
{"tag": "What is the difference between mental health professionals?","patterns": ["What is the difference between mental health professionals?"],"responses": ["There are many types of mental health professionals. The variety of providers and their services may be confusing. Each have various levels of education, training, and may have different areas of expertise. Finding the professional who best fits your needs may require some research."]
      },
{"tag": "How can I find a mental health professional right for my child or myself?","patterns": ["How can I find a mental health professional right for my child or myself?"],"responses": ["Feeling comfortable with the professional you or your child is working with is critical to the success of your treatment. Finding the professional who best fits your needs may require some research."]
      },
{"tag": "If I become involved in treatment what do I need to know?","patterns": ["If I become involved in treatment what do I need to know?"],"responses": ["It is important to continue involvement in the treatment process as much as possible."]
      },
{"tag": "Where else can I get help?","patterns": ["Where else can I get help?"],"responses": ["family member, friend, clergy, healthcare provider, or other professionals"]
      },
{"tag": "What should I know before starting a new medication?","patterns": ["What should I know before starting a new medication?"],"responses": ["The best source of information regarding medications is the physician prescribing them"]
      },
{"tag": "If I feel better after taking medication, does this mean I am cured and can stop taking it?","patterns": ["If I feel better after taking medication, does this mean I am cured and can stop taking it?"],"responses": ["Create a plan for switching to a different treatment that will be a better fit."]
      },
{"tag": "How can I get help paying for my medication?","patterns": ["How can I get help paying for my medication?"],"responses": ["Visit Healthfinder.gov to learn more."]
      },
{"tag": "Where can I go to find therapy","patterns": ["Where can I go to find therapy"],"responses": ["Several different types of treatment and therapy that can help."]
      },
{"tag": "Where can I learn about types of mental health treatment?","patterns": ["Where can I learn about types of mental health treatment?"],"responses": ["Mental health conditions are often treated with medication, therapy or a combination of the two."]
      },
{"tag": "What are the different types of mental health professionals?","patterns": ["What are the different types of mental health professionals?"],"responses": ["There are many types of mental health professionals. Finding the right one for you may require some research."]
      },
{"tag": "Where can I go to find a support group?","patterns": ["Where can I go to find a support group?"],"responses": ["Many people find peer support a helpful tool that can aid in their recovery."]
      },
{"tag": "Where can I go to find inpatient care?","patterns": ["Where can I go to find inpatient care?"],"responses": ["Inpatient care can help people stabilize on new medications, adjust to new symptoms, or get the help they need."]
      },
{"tag": "Where can I go to find other local services?","patterns": ["Where can I go to find other local services?"],"responses": ["There are likely plenty of resources that can be used to help you find mental health treatment in your community. These resources can help you find the right therapist, and enable you to better understand viable treatment options and the treatment process."]
      },
{"tag": "Where can I learn more information about clinical trials?","patterns": ["Where can I learn more information about clinical trials?"],"responses": ["Sometimes, consumers of mental health services may consider participating in a research study when they have not experienced improvement despite having tried a variety of medications and treatments. Research studies (also known as clinical trials) may involve the use of new medications or new treatment approaches whose safety and effectiveness is being tested. While we support innovation in the field, consumers should be cautioned that there are risks associated with clinical trials – make sure you’re aware of them before you enroll."]
      },
{"tag": "Where can I learn more information about creating a Psychiatric Advance Directive?","patterns": ["Where can I learn more information about creating a Psychiatric Advance Directive?"],"responses": ["Similar to a medical advance directive or a health care power of attorney, a psychiatric advance directive is a legal document completed in a time of wellness that provides instructions regarding treatment or services one wishes to have or not have during a mental health crisis, and may help influence his or her care."]
      },
{"tag": "What is mental health?","patterns": ["What is mental health?"],"responses": ["We all have mental health which is made up of our beliefs, thoughts, feelings and behaviours."]
      },
{"tag": "What do I do if the support doesn’t help?","patterns": ["What do I do if the support doesn’t help?"],"responses": ["It can be difficult to find the things that will help you, as different things help different people. It's important to be open to a range of approaches and to be committed to finding the right help and to continue to be hopeful, even when some things don't work out."]
      },
{"tag": "Can you prevent mental health problems?","patterns": ["Can you prevent mental health problems?"],"responses": ["We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious."]
      },
{"tag": "Are there cures for mental health problems?","patterns": ["Are there cures for mental health problems?"],"responses": ["It is often more realistic and helpful to find out what helps with the issues you face. Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help."]
      },
{"tag": "What causes mental health problems?","patterns": ["What causes mental health problems?"],"responses": ["Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events."]
      },
{"tag": "What do I do if I’m worried about my mental health?","patterns": ["What do I do if I’m worried about my mental health?"],"responses": ["The most important thing is to talk to someone you trust. This might be a friend, colleague, family member, or GP. In addition to talking to someone, it may be useful to find out more information about what you are experiencing. These things may help to get some perspective on what you are experiencing, and be the start of getting help."]
      },
{"tag": "How do I know if I’m unwell?","patterns": ["How do I know if I’m unwell?"],"responses": ["If your beliefs , thoughts , feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help."]
      },
{"tag": "What should I do if I’m worried about a friend or relative?","patterns": ["What should I do if I’m worried about a friend or relative?"],"responses": ["This may depend on your relationship with them. Gently encouraging someone to seek appropriate support would be helpful to start with."]
      },
{"tag": "How do I deal with someone telling me what to do?","patterns": ["How do I deal with someone telling me what to do?"],"responses": ["Some people may advise you on good evidence of what works with the best of intentions, but it's important to find out what works best for you."]
      },
{"tag": "Why do I need to keep informed?","patterns": ["Why do I need to keep informed?"],"responses": ["It may be tempting to try to block out the world altogether to avoid bad news, but it's important to keep yourself informed. We all have to step up during a pandemic because we all have a part to play in reducing the spread of the virus. It's important that you know what must be done and how you should do it. This is important for the health of your neighbours and your own mental health, and taking action can help counter difficult feelings like hopelessness and despair. One study from people in China found that people who had reliable up-to-date information about the coronavirus and COVID-19 illness and accurate instructions on how they should act (such as instructions around hand-washing and wearing a mask) felt more resilient and felt better able to handle the virus. People who received good, accurate information reported lower levels of stress, anxiety, and depression. This research is available for free at www.mdpi.com/1660-4601/17/5/1729. Of course, it's okay to set limits. Staying informed does not mean that you have to follow the news all day. Check in a few times a day, sticking to trusted sources and media outlets. While social media can be a great way to keep in touch with family and friends, social media can also amplify bad advice, vague or untrue stories, and other unhelpful information. Be sure to use good critical thinking skills."]
      },
{"tag": "How can I tell if health information is good or bad?","patterns": ["How can I tell if health information is good or bad?"],"responses": ["Anyone can post anything online. It's up to the readers to think critically about information to decide if it seems helpful, truthful, or safe. Here are key points to keep in mind as you determine which information is worth considering and which information doesn't pass the test. It's so easy to spread information online, and we can't assume that the source we're reading or watching is the original source. Before you can evaluate anything, you need to know where the claims come from and determine if it's a reliable source. Reliable sources on the coronavirus and COVID-19 illness include the World Health Organization (WHO), Government of Canada ministries and agencies like Health Canada and the Public Health Agency of Canada, the Government of BC ministries and agencies like the BC Ministry of Health, and the BC Centre for Disease Control (BCCDC). Scientists and researchers at universities and other institutions and health sciences professionals are also important sources of information. Headlines and titles need to be simple and short, so they can sometimes be misleading on their own. They may also be purposefully shocking or controversial to entice you to click to read more. Websites that belong to governments, government-funded agencies, well-known health providers, universities, or groups of medical professionals are generally the most reliable. Be careful of sites that don't list the author or don't tell you much about themselves. Double-check the author and the credentials of any 'experts' quoted or cited to see if they are actually experts in the topic being discussed. Can you find other evidence from other sources to support the claims? Does the author list their sources? Are the sources legitimate, like research journals? Unhelpful sources want you to feel a certain way: scared, angry, distrustful, vulnerable. Phrases like Skyrocketing rates of infection are sensational and they're meant to make people feel afraid. On the other hand, factual statements like We have 50 new cases in BC give you important information without playing into your emotions. Helpful news or information sources want you feel informed and empowered. Who is paying for the site? What products or services are being advertised? What links or other sites do they promote? Are you learning something from a story or experience, or are you simply being directed to buy a product or service? Social media can be a great way to keep in touch with family and friends, especially as we practice physical distancing or self-isolation. Social media can also be an important way to learn from health experts and connect to support services and mutual aid groups in your community. Like any other source of information, it's important to use good critical thinking skills when you use social media. Studies find that searching for health information on social media generally has very mixed results. You'll see both very poor-quality sources next to good-quality sources, and it's up to you to decide which is which. In addition, social media posts tend to be short and rarely capture everything you need to consider. They are generally useful as a way to start learning or exploring different points of view rather than a place to gather all the information. Visit www.mediasmarts.ca to learn more about digital and media literacy. Visit www.healthnewsreview.org to learn more about thinking critically around health claims (this resource is no longer updated daily, but all toolkits and lessons are still available). This page is adapted from the Evaluating Mental Health and Substance Use Information info sheet."]
      }

    ]  
    }
    
